In [0]:
# importing the pandas library
#
import pandas as pd
# importing the Numpy library
import numpy as np
#

In [114]:
# data understanding
# previewing Telcom_dataset and defining the dataset:
#
telcom1 = pd.read_csv('Telcom_dataset.csv', delimiter = ',')
telcom1.head(2)

  PRODUTC  VALUE               DATETIME  ... COUNTRY_B     CELL_ID     SITE_ID
0   Voice      0  2012-05-06 23:04:37.0  ...     19e2e  /TJNe+Mmtu  /TJNe+Mmtu
1     sms      0  2012-05-06 23:05:25.0  ...     19e2e  /+cKZKIp41  /+cKZKIp41

[2 rows x 10 columns]

In [115]:
# data understanding
# previewing Telcom_dataset2 and defining the dataset:
# 
telcom2 = pd.read_csv('Telcom_dataset2.csv', delimiter = ',')
telcom2.head(2)

  PRODUCT  VALUE              DATE_TIME  ... COUNTRY_B     CELL_ID     SITE_ID
0     sms      0  2012-05-07 23:02:06.0  ...     19e2e  +854AcBQT2  +854AcBQT2
1   Voice      0  2012-05-07 23:03:44.0  ...     19e2e  +854AcBQT2  +854AcBQT2

[2 rows x 10 columns]

In [116]:
# data understanding
# previewing Telcom_dataset3 and defining the dataset:
# 
telcom3 = pd.read_csv('Telcom_dataset3.csv', delimiter = ',')
telcom3.head(2)

  PRODUCT  VALUE              DATE_TIME  ... COUNTRY_B      CELLID     SIET_ID
0   Voice     61  2012-05-08 23:01:28.0  ...     19e2e  +38u2u/rfx  +38u2u/rfx
1     sms      0  2012-05-08 23:01:31.0  ...     19e2e  +Fs4mTvdKx  +Fs4mTvdKx

[2 rows x 10 columns]

In [117]:
# data understanding
# previewing the cells_geo data and defining the dataset:
#
cellsgeo = pd.read_csv('cells_geo.csv', delimiter = ';')
cellsgeo.head(2)

   Unnamed: 0  VILLES      STATUS  ... AREA     CELL_ID   SITE_CODE
0           0  ADJAME  In Service  ...  NaN  fbb2e75af3  0bb492ef17
1           1  ADJAME  In Service  ...  NaN  1502501d78  0bb492ef17

[2 rows x 12 columns]

In [118]:
# data understanding
# finding total cities with MTN coverage:
df = pd.read_csv('cells_geo.csv', delimiter = ';')
df.VILLES.unique()
len(df.VILLES.unique().tolist())

504

In [121]:
# data preparation
# dropping 'CELL_ON_SITE','COUNTRY_A',	'COUNTRY_B' columns that are not needed for analysis in telcom1 dataset:
# 
telcom1.drop(telcom1.columns[[3,6,7]], axis = 1, inplace = True) 
telcom1.head(2)
#

  PRODUTC  VALUE  ...     CELL_ID     SITE_ID
0   Voice      0  ...  /TJNe+Mmtu  /TJNe+Mmtu
1     sms      0  ...  /+cKZKIp41  /+cKZKIp41

[2 rows x 7 columns]

In [122]:
# data preparation
# renaming "telcom1" dataset columns to match the other similar datasets(telcom2, telcom3) for easier analysis:
# 
telcom1.rename(columns = {'PRODUTC':'product','VALUE':'billingprice','DATETIME':'date_time','DW_A_NUMBER_INT':'contact1','DW_B_NUMBER_INT':'contact2','CELL_ID':'cellid','SITE_ID':'siteid'}, inplace = True)
telcom1.head(2)

  product  billingprice  ...      cellid      siteid
0   Voice             0  ...  /TJNe+Mmtu  /TJNe+Mmtu
1     sms             0  ...  /+cKZKIp41  /+cKZKIp41

[2 rows x 7 columns]

In [124]:
# data preparation
# dropping 'CELL_ON_SITE','COUNTRY_A',	'COUNTRY_B' columns that are not needed for analysis in telcom2:
# 
telcom2.drop(telcom2.columns[[3, 6, 7]], axis = 1, inplace = True) 
telcom2.head(2)

  PRODUCT  VALUE  ...     CELL_ID     SITE_ID
0     sms      0  ...  +854AcBQT2  +854AcBQT2
1   Voice      0  ...  +854AcBQT2  +854AcBQT2

[2 rows x 7 columns]

In [125]:
# data preparation 
# then renaming "telcom2" dataset column names to match the other similar datasets(telcom1, telcom3) for easier analysis:
#  
telcom2.rename(columns = {'PRODUCT':'product','VALUE':'billingprice','DATE_TIME':'date_time','DW_A_NUMBER':'contact1','DW_B_NUMBER':'contact2','CELL_ID':'cellid','SITE_ID':'siteid'}, inplace = True)
telcom2.head(2)

  product  billingprice  ...      cellid      siteid
0     sms             0  ...  +854AcBQT2  +854AcBQT2
1   Voice             0  ...  +854AcBQT2  +854AcBQT2

[2 rows x 7 columns]

In [127]:
# data preparation
# dropping 'CELL_ON_SITE','COUNTRY_A',	'COUNTRY_B' columns that are not needed for analysis in telcom3:
# 
telcom3.drop(telcom3.columns[[3, 6, 7]], axis = 1, inplace = True) 
telcom3.head(2)

  PRODUCT  VALUE  ...      CELLID     SIET_ID
0   Voice     61  ...  +38u2u/rfx  +38u2u/rfx
1     sms      0  ...  +Fs4mTvdKx  +Fs4mTvdKx

[2 rows x 7 columns]

In [129]:
# data preparation
# then renaming "telcom3" dataset column names to match the other similar datasets(telcom2, telcom1) for easier analysis:
# 
telcom3.rename(columns = {'PRODUCT':'product','VALUE':'billingprice','DATE_TIME':'date_time','DW_A_NUMBER_INT':'contact1','DW_B_NUMBER_INT':'contact2','CELLID':'cellid','SIET_ID':'siteid'}, inplace = True)
telcom3.head(2)

  product  billingprice  ...      cellid      siteid
0   Voice            61  ...  +38u2u/rfx  +38u2u/rfx
1     sms             0  ...  +Fs4mTvdKx  +Fs4mTvdKx

[2 rows x 7 columns]

In [130]:
# data preparation
# dropping '# dropping 'AREA','LONGITUDE',	'LATITUDE', 'DECOUPZONE' columns that are not needed for 
# analysis in 'cells_geo', then defining the dataset to 'cellsgeo':
cellsgeo.drop(cellsgeo.columns[[4, 6, 7, 9]], axis = 1, inplace = True) 
cellsgeo.head(2)

   Unnamed: 0  VILLES      STATUS  ...  REGION     CELL_ID   SITE_CODE
0           0  ADJAME  In Service  ...  LAGUNE  fbb2e75af3  0bb492ef17
1           1  ADJAME  In Service  ...  LAGUNE  1502501d78  0bb492ef17

[2 rows x 8 columns]

In [131]:
# data preparation
# then renaming "cellsgeo" dataset column names to match the other similar datasets columns(telcom1, telcom2, telcom3) for easier analysis:
#
cellsgeo.rename(columns = {'VILLES':'city','STATUS':'status','LOCALISATION':'location','ZONENAME':'zone','REGION':'region','CELL_ID':'cellid','SITE_CODE':'siteid'}, inplace = True)
cellsgeo.head(5)

   Unnamed: 0     city      status  ...     region      cellid      siteid
0           0   ADJAME  In Service  ...     LAGUNE  fbb2e75af3  0bb492ef17
1           1   ADJAME  In Service  ...     LAGUNE  1502501d78  0bb492ef17
2           2   ADJAME  In Service  ...     LAGUNE  0c2e182a0c  0bb492ef17
3           3  ASSINIE  In Service  ...  SUD COMOE  69bdfc69fd  8a1e6ce31f
4           4  ASSINIE  In Service  ...  SUD COMOE  7a1029d2ab  8a1e6ce31f

[5 rows x 8 columns]

In [243]:
# data preparation
# concatenating telcom1, telcom2 and telcom3 datasets:
#
alldataset = telcom1.append([telcom2, telcom3])
alldataset

     product  billingprice  ...      cellid      siteid
0      Voice             0  ...  /TJNe+Mmtu  /TJNe+Mmtu
1        sms             0  ...  /+cKZKIp41  /+cKZKIp41
2        sms            25  ...  /u0FSD+ahi  /u0FSD+ahi
3      Voice            56  ...  +cNeJzsTp3  +cNeJzsTp3
4      Voice            14  ...  051KhYDCpv  051KhYDCpv
...      ...           ...  ...         ...         ...
4996   Voice             0  ...  2aa04dcab7  f7d63a29e5
4997   Voice            62  ...  7f1f2f889f  b4ddb9e93c
4998   Voice            32  ...  a4731e780e  d68260ef50
4999   Voice            30  ...  98ed726da2  b4130b54ab
5000   Voice            60  ...  1c11a2fcbb  6d70dae094

[15003 rows x 7 columns]

In [71]:
# analysis
# being there are many sites in a city,
# counting 'siteid' frequencies to find the siteid with the highest frequency from alldataset:
count_siteid = alldataset['siteid'].value_counts()
print(count_siteid)

7f76d66503    113
b47a998a3e     99
a7bd4c027b     80
5c565fbfb1     76
91e86be9a6     73
             ...
b5bd954080      1
cc45c41e85      1
Twwak+qM4B      1
73c47c6862      1
b7fa7cc061      1
Name: siteid, Length: 1357, dtype: int64

In [239]:
# analysis
# determining which city the site with the highest frequency(7f76d66503) is located, from 'cellsgeo' dataset:
#
siteid_city = cellsgeo[cellsgeo.siteid.eq('7f76d66503')]
siteid_city.head(1)
#
# this returns ATTECOUBE as the city with the highest siteid frequency.

      Unnamed: 0       city      status  ...  region      cellid      siteid
1024        1024  ATTECOUBE  In Service  ...  LAGUNE  1ce5a37ea9  7f76d66503

[1 rows x 8 columns]

Other cities with high frequencies in site ID:

In [255]:
siteid_city = cellsgeo[cellsgeo.siteid.eq('5c565fbfb1')]
siteid_city.head(1)

      Unnamed: 0    city      status  ...  region      cellid      siteid
3689        3689  ADJAME  In Service  ...  LAGUNE  26a72e2271  5c565fbfb1

[1 rows x 8 columns]

In [253]:
siteid_city = cellsgeo[cellsgeo.siteid.eq('91e86be9a6')]
siteid_city.head(1)

      Unnamed: 0      city      status  ...  region      cellid      siteid
2883        2883  YOPOUGON  In Service  ...  LAGUNE  c6fda01077  91e86be9a6

[1 rows x 8 columns]

In [237]:
# splitting datetime strings into separate columns to compute servise utilization from the :
#
alldataset = alldataset['date_time'].apply(lambda x: pd.Series([i for i in reversed(x.lower().split(' '))]))
alldataset.columns = ['time','date']
print(alldataset)

            time        date
0     23:04:37.0  2012-05-06
1     23:05:25.0  2012-05-06
2     23:05:41.0  2012-05-06
3     23:05:42.0  2012-05-06
4     23:06:29.0  2012-05-06
...          ...         ...
4996  00:01:43.0  2012-05-09
4997  00:01:43.0  2012-05-09
4998  00:01:43.0  2012-05-09
4999  00:01:43.0  2012-05-09
5000  00:01:43.0  2012-05-09

[15003 rows x 2 columns]